#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.api.data.local_file.mock_response_get_files["about_page_content"]: Reading...
module.api.data.local_file.mock_response_get_files["featured_projects"]: Reading...
module.api.data.local_file.mock_response_get_files["about_page_content"]: Read complete after 0s [id=d3b845625b1da606b2782181d2fa37859285d76c]
module.api.data.local_file.mock_response_get_files["featured_projects"]: Read complete after 0s [id=e32261d3c5c27bd4e8a1dd61ec4b12c695eae63f]
module.api.aws_api_gateway_resource.about_page_content: Refreshing state... [id=l4m8i2]
module.api.aws_api_gateway_method_response.about_page_content_method_response: Refreshing state... [id=agmr-ktjk0455h9-l4m8i2-GET-200]
module.api.aws_api_gateway_method.about_page_content_method: Refreshing state... [id=agm-ktjk0455h9-l4m8i2-GET]
module.api.aws_api_gateway_integration.about_page_content_integration: Refreshing state... [id=agi-ktjk0455h9-l4m8i2-GET]
module.api.aws_api_gateway_rest_api.thomaskimble: Refreshing state... [id=ktjk0455h9]
module.frontend.data.aws_secretsmanager_secret.secret: Reading...
module.domain_management.aws_route53_zone.thomaskimble: Refreshing state... [id=Z09261682MMR79C15BLZ9]
module.api.aws_api_gateway_integration_response.about_page_content_integration_response: Refreshing state... [id=agir-ktjk0455h9-l4m8i2-GET-200]
module.domain_management.aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/36b7b09b-b03e-4036-8a14-dfd49c4e4fff]
module.domain_management.aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_legacy_CNAME]
module.domain_management.aws_route53_record.thomaskimble_outlook_mx_record: Refreshing state... [id=Z09261682MMR79C15BLZ9__MX]
module.domain_management.aws_route53_record.thomaskimble_outlook_autodiscover_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_autodiscover_CNAME]
module.domain_management.aws_route53_record.thomaskimble_txt_records: Refreshing state... [id=Z09261682MMR79C15BLZ9__TXT]
module.domain_management.aws_route53_record.thomaskimble_email_secureserver_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_email_CNAME]
module.frontend.data.aws_secretsmanager_secret.secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
module.frontend.data.aws_secretsmanager_secret_version.current: Reading...
module.frontend.data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
module.frontend.aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d212nepszzoptn]
module.api.aws_api_gateway_deployment.api_deployment: Refreshing state... [id=m70v03]
module.api.aws_api_gateway_domain_name.thomaskimble_api_gateway_domain_name: Refreshing state... [id=api.thomaskimble.com]
module.domain_management.aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.domain_management.aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.domain_management.aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.api.aws_api_gateway_stage.thomaskimble_prod: Refreshing state... [id=ags-ktjk0455h9-prod]
module.domain_management.aws_route53_record.thomaskimble_api_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_api_A]
module.frontend.aws_amplify_branch.main: Refreshing state... [id=d212nepszzoptn/main]
module.frontend.aws_amplify_branch.dev: Refreshing state... [id=d212nepszzoptn/dev]
module.api.aws_api_gateway_base_path_mapping.thomaskimble_api_gateway_mapping: Refreshing state... [id=api.thomaskimble.com/]
module.frontend.aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d212nepszzoptn/thomaskimble.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.api.aws_api_gateway_deployment.api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_deployment" {
      ~ created_date  = "2024-05-15T14:45:32Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-1:287212251408:ktjk0455h9/" -> (known after apply)
      ~ id            = "m70v03" -> (known after apply)
      ~ invoke_url    = "https://ktjk0455h9.execute-api.eu-west-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "ce1f08af2bb0dfc467c1f7353b786c8574fbc2d3"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_api_gateway_integration.about_page_content_integration will be destroyed
  # (because aws_api_gateway_integration.about_page_content_integration is not in configuration)
  - resource "aws_api_gateway_integration" "about_page_content_integration" {
      - cache_key_parameters = [] -> null
      - cache_namespace      = "l4m8i2" -> null
      - connection_type      = "INTERNET" -> null
      - http_method          = "GET" -> null
      - id                   = "agi-ktjk0455h9-l4m8i2-GET" -> null
      - passthrough_behavior = "WHEN_NO_MATCH" -> null
      - request_parameters   = {} -> null
      - request_templates    = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id          = "l4m8i2" -> null
      - rest_api_id          = "ktjk0455h9" -> null
      - timeout_milliseconds = 29000 -> null
      - type                 = "MOCK" -> null
    }

  # module.api.aws_api_gateway_integration.mock_get_integrations["about_page_content"] will be created
  + resource "aws_api_gateway_integration" "mock_get_integrations" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = "WHEN_NO_MATCH"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "ktjk0455h9"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.api.aws_api_gateway_integration.mock_get_integrations["featured_projects"] will be created
  + resource "aws_api_gateway_integration" "mock_get_integrations" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = "WHEN_NO_MATCH"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "ktjk0455h9"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.api.aws_api_gateway_integration_response.about_page_content_integration_response will be destroyed
  # (because aws_api_gateway_integration_response.about_page_content_integration_response is not in configuration)
  - resource "aws_api_gateway_integration_response" "about_page_content_integration_response" {
      - http_method         = "GET" -> null
      - id                  = "agir-ktjk0455h9-l4m8i2-GET-200" -> null
      - resource_id         = "l4m8i2" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = <<-EOT
                {
                          "title": "About Me",
                          "date": "2024-05-14T15:23:56Z",
                          "bodyClass": "page-about",
                          "sections": [
                              {
                                  "type": "text",
                                  "content": "My name is **Thomas Oliver Kimble**, an engineer with a rich blend of skills and interests, encompassing data science, robotics, cloud engineering, and a strong passion for both music and design."
                              },
                              {
                                  "type": "image",
                                  "src": "/images/about/me.jpg"
                              },
                              {
                                  "type": "header",
                                  "content": "Personal Life"
                              },
                              {
                                  "type": "text",
                                  "content": "Originally from England, I moved to Switzerland when I was three and later to France. My education was mainly in Switzerland, where I pursued engineering—a field that aligned perfectly with my passion for math, science, and design. This combination of interests led me to explore both the analytical and creative sides of my personality, particularly through music. From the age of seven, I was immersed in music, playing in bands and learning instruments like the guitar, drums, and piano."
                              }
                          ]
                      }
            EOT
        } -> null
      - rest_api_id         = "ktjk0455h9" -> null
      - status_code         = "200" -> null
    }

  # module.api.aws_api_gateway_integration_response.mock_get_integration_responses["about_page_content"] will be created
  + resource "aws_api_gateway_integration_response" "mock_get_integration_responses" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = jsonencode(
                {
                  + bodyClass = "page-about"
                  + sections  = [
                      + {
                          + title = "About Me"
                          + type  = "title"
                        },
                      + {
                          + content = "My name is **Thomas Oliver Kimble**, an engineer with a rich blend of skills and interests, encompassing data science, robotics, cloud engineering, and a strong passion for both music and design."
                          + type    = "text"
                        },
                      + {
                          + src  = "/images/about/me.jpg"
                          + type = "image"
                        },
                      + {
                          + content = "Personal Life"
                          + type    = "header"
                        },
                      + {
                          + content = "Originally from England, I moved to Switzerland when I was three and later to France. My education was mainly in Switzerland, where I pursued engineering—a field that aligned perfectly with my passion for math, science, and design. This combination of interests led me to explore both the analytical and creative sides of my personality, particularly through music. From the age of seven, I was immersed in music, playing in bands and learning instruments like the guitar, drums, and piano."
                          + type    = "text"
                        },
                      + {
                          + content = "Education"
                          + type    = "header"
                        },
                      + {
                          + content = "I completed a scientific French Baccalauréat in 2015 and went on to earn a Bachelor’s Degree in Microengineering from EPFL in 2019. I furthered my education with a Master’s degree in Robotics from EPFL, specializing in Data Science and Space Technologies. My time at EPFL enriched my skills across various engineering fields, with a deep dive into robotics-oriented software engineering and Data in the final years."
                          + type    = "text"
                        },
                      + {
                          + content = "Professional Experience"
                          + type    = "header"
                        },
                      + {
                          + content = "My professional journey has been a blend of technical innovation and creative design. At Maffi Racing in Geneva, I led projects like the website redesign and the creation of a new livery for their Formula 4 car, integrating artistic elements with brand identity."
                          + type    = "text"
                        },
                      + {
                          + content = "During my master’s thesis at Cyberbotics, I worked on the Webots robotics simulator, improving its functionality and performance. This included enhancements to the robotbenchmark.net and webots.cloud platforms, making them more secure and efficient for online simulations."
                          + type    = "text"
                        },
                      + {
                          + content = "I was a Cloud Data Engineer at Pictet Group, focusing on building reliable and robust cloud-based data solutions. My work involved data science, data engineering, software development, DevOps, helping to create scalable data platforms and collaborate effectively with diverse teams."
                          + type    = "text"
                        },
                      + {
                          + content = "Currently at Cafeyn, I am working on the Data Engineering team as a Platform Engineer, focusing on enhancing and refining data pipelines and infrastructure to improve Machine Learning integration. My role involves developing robust and scalable data platforms, optimizing the way we transform data into actionable insights."
                          + type    = "text"
                        },
                      + {
                          + content = "Career Aspirations"
                          + type    = "header"
                        },
                      + {
                          + content = "Looking ahead, I am eager to explore opportunities in Data Science, Data Engineering, DevOps, and Cloud Engineering. My diverse expertise, coupled with my passion for design and problem-solving, uniquely positions me for roles that demand innovation, technical skill, and a strategic mindset."
                          + type    = "text"
                        },
                    ]
                }
            )
        }
      + rest_api_id        = "ktjk0455h9"
      + status_code        = "200"
    }

  # module.api.aws_api_gateway_integration_response.mock_get_integration_responses["featured_projects"] will be created
  + resource "aws_api_gateway_integration_response" "mock_get_integration_responses" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = jsonencode(
                {
                  + projects = [
                      + {
                          + id        = "1"
                          + imagePath = "swarm.png"
                          + name      = "swarm"
                          + title     = "drone swarms"
                        },
                      + {
                          + id        = "2"
                          + imagePath = "friendship.png"
                          + name      = "friendship"
                          + title     = "friend prediction"
                        },
                      + {
                          + id        = "3"
                          + imagePath = "butterfly.png"
                          + name      = "butterfly"
                          + title     = "butterfly shelf"
                        },
                      + {
                          + id        = "4"
                          + imagePath = "intent.png"
                          + name      = "intent"
                          + title     = "chatbot intent"
                        },
                      + {
                          + id        = "5"
                          + imagePath = "thymio.png"
                          + name      = "thymio"
                          + title     = "robot navigation"
                        },
                    ]
                }
            )
        }
      + rest_api_id        = "ktjk0455h9"
      + status_code        = "200"
    }

  # module.api.aws_api_gateway_method.about_page_content_method will be destroyed
  # (because aws_api_gateway_method.about_page_content_method is not in configuration)
  - resource "aws_api_gateway_method" "about_page_content_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-ktjk0455h9-l4m8i2-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "l4m8i2" -> null
      - rest_api_id          = "ktjk0455h9" -> null
    }

  # module.api.aws_api_gateway_method.mock_get_methods["about_page_content"] will be created
  + resource "aws_api_gateway_method" "mock_get_methods" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "ktjk0455h9"
    }

  # module.api.aws_api_gateway_method.mock_get_methods["featured_projects"] will be created
  + resource "aws_api_gateway_method" "mock_get_methods" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "ktjk0455h9"
    }

  # module.api.aws_api_gateway_method_response.about_page_content_method_response will be destroyed
  # (because aws_api_gateway_method_response.about_page_content_method_response is not in configuration)
  - resource "aws_api_gateway_method_response" "about_page_content_method_response" {
      - http_method         = "GET" -> null
      - id                  = "agmr-ktjk0455h9-l4m8i2-GET-200" -> null
      - resource_id         = "l4m8i2" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {} -> null
      - rest_api_id         = "ktjk0455h9" -> null
      - status_code         = "200" -> null
    }

  # module.api.aws_api_gateway_method_response.mock_get_method_responses["about_page_content"] will be created
  + resource "aws_api_gateway_method_response" "mock_get_method_responses" {
      + http_method     = "GET"
      + id              = (known after apply)
      + resource_id     = (known after apply)
      + response_models = {
          + "application/json" = "Empty"
        }
      + rest_api_id     = "ktjk0455h9"
      + status_code     = "200"
    }

  # module.api.aws_api_gateway_method_response.mock_get_method_responses["featured_projects"] will be created
  + resource "aws_api_gateway_method_response" "mock_get_method_responses" {
      + http_method     = "GET"
      + id              = (known after apply)
      + resource_id     = (known after apply)
      + response_models = {
          + "application/json" = "Empty"
        }
      + rest_api_id     = "ktjk0455h9"
      + status_code     = "200"
    }

  # module.api.aws_api_gateway_resource.about_page_content will be destroyed
  # (because aws_api_gateway_resource.about_page_content is not in configuration)
  - resource "aws_api_gateway_resource" "about_page_content" {
      - id          = "l4m8i2" -> null
      - parent_id   = "ojq7x0ztnc" -> null
      - path        = "/AboutPageContent" -> null
      - path_part   = "AboutPageContent" -> null
      - rest_api_id = "ktjk0455h9" -> null
    }

  # module.api.aws_api_gateway_resource.mock_get_resources["about_page_content"] will be created
  + resource "aws_api_gateway_resource" "mock_get_resources" {
      + id          = (known after apply)
      + parent_id   = "ojq7x0ztnc"
      + path        = (known after apply)
      + path_part   = "about_page_content"
      + rest_api_id = "ktjk0455h9"
    }

  # module.api.aws_api_gateway_resource.mock_get_resources["featured_projects"] will be created
  + resource "aws_api_gateway_resource" "mock_get_resources" {
      + id          = (known after apply)
      + parent_id   = "ojq7x0ztnc"
      + path        = (known after apply)
      + path_part   = "featured_projects"
      + rest_api_id = "ktjk0455h9"
    }

  # module.api.aws_api_gateway_stage.thomaskimble_prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "thomaskimble_prod" {
      ~ deployment_id         = "1zzai4" -> (known after apply)
        id                    = "ags-ktjk0455h9-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 11 to add, 1 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*